Tekla.Structures.Dialog.UIControls.CommitAction
The CommitAction class represents a "template" dialog for commit actions.

Tekla.Structures.Dialog.UIControls.CommitAction.#ctor
Initializes a new instance of the CommitAction class.

Tekla.Structures.Dialog.UIControls.CommitAction.OnLoad(System.EventArgs)
The commit action dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.CommitAction.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.CommitAction.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.CommitAction.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.

Tekla.Structures.Dialog.UIControls.CommitAction.groupBox
The groupBox contains the main options.

Tekla.Structures.Dialog.UIControls.CommitAction.suboptionsButton
The suboptionsButton opens the suboptions dialog.

Tekla.Structures.Dialog.UIControls.CommitAction.optionalGroupBox
The optionalGroupBox contains the optional options.

Tekla.Structures.Dialog.UIControls.CommitAction.optionalSuboptionsButton
The optionalSuboptionsButton opens the suboptions dialog for the optional
options.

Tekla.Structures.Dialog.UIControls.CommitAction.verbButton
The verbButton (to be changed by the user).

Tekla.Structures.Dialog.UIControls.CommitAction.cancelButton
The cancelButton cancels the commit.

Tekla.Structures.Dialog.UIControls.CommitAction.optionalOptionsLabel
The optionalOptionsLabel: the optional options label (to be changed by the user).

Tekla.Structures.Dialog.UIControls.CommitAction.optionsLabel
The optionsLabel: the options label (to be changed by the user).